Въпрос 1:
Защо да използваме свързани списъци върху масиви?
а) Тъй като свързаните списъци са удобни за паметта, трябва да използваме свързани списъци, за да спестим малко място.
б) Защото е по-лесно да сортирате свързан списък.
в) Тъй като е по-бързо да вмъкнете елементи в началото на списъка, тъй като не трябва да пренареждаме масива, просто актуализирайте препратките съответно.

Въпрос 2:
Коя структура от данни да изберем, ако целта ни е да минимизираме количеството памет, което използваме?
a) Масив
б) Свързан списък

Въпрос 3:
Свързаните списъци са динамични структури от данни (те могат да растат органично без проблеми).
a) Вярно
б) Грешно
